Revit 2027 API
BuiltInFailures.FamilyFailures.InvalidContextForAdaptivePlacement Property
 The component '%1!s!' cannot be directly placed in the project environment. Place it in either an In-Place Mass, a Conceptual Mass Family, a Curtain Panel by Pattern Family, or an Adaptive Component.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidContextForAdaptivePlacement { get; }
Public Shared ReadOnly Property InvalidContextForAdaptivePlacement As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidContextForAdaptivePlacement {
	FailureDefinitionId^ get ();
}
static member InvalidContextForAdaptivePlacement : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace